isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
/***************************************************************************
 * 文件名称: ethercat_slave_c28x_hal.c
 * 文件说明: 用于EtherCAT从控制器(ESC)的C28x HAL硬件功能驱动
 * 功能说明:
 *         (1)本驱动适用于EtherCAT控制器ET1200/ET1100
 *         (2)本驱动适用于C28x内核的DSP控制器
 *         (3)本驱动可使用LaunchPad_F28379D评估板测试
 *            如果使用评估板,在全局宏定义中定义_LAUNCHXL_F28379D
 *从站器件说明:
 *         (1)器件ET1100/ET1200读写寄存器帧格式:
 *            读寄存器:
 *            1.三字节地址模式读寄存器
 *            Byte 0: A[12:5]  //寄存器地址5到12位
 *            Byte 1: A[4:0] + 110B, //寄存器地址0到4位 + 110B(三字节模式命令)
 *            Byte 2: A[15:13] + 010B + 00b //寄存器地址13到15位 + 010B(读数据模式)
 *            Byte 3: 0xFF //读取数据结束字节
 *            2.二字节地址模式读寄存器
 *            3.三字节地址模式写寄存器
 *            Byte 0: A[12:5]  //寄存器地址5到12位
 *            Byte 1: A[4:0] + 110b //寄存器地址0到4位  + 110B(三字节模式命令)
 *            Byte 2: A[15:13] + 100b + 00b //寄存器地址13到15位 +100B(写数据模式)
 *            4.二字节地址迷失写寄存器
 * 完成时间:
 *    版本:
 * 修改记录:
 * *************************************************************************/
#include "F28x_Project.h"
#include "F2837xD_spi.h"
#include "ethercat_slave_c28x_hal.h"
/*****************************EMIF接口数据************************************/
#ifdef INTERFACE_EMIF
//指向ESC存储器的指针，在仅用于ASYNC16（EMIF1或EMIF2）PDI的ESC_initHW()中初始化
uint16_t *pEsc;
#endif //INTERFACE_EMIF
/**************************PDI_HAL_TEST功能数据*******************************/
#ifdef PDI_HAL_TEST
#if(HAL_ET1100)
//调试数组以记录ESC寄存器，仅用于PDI_HAL_TEST
esc_et1100_regs_t escRegs[ESC_DEBUG_REGS_LENGTH];
#elif(HAL_ET1200)
//调试数组以记录ESC寄存器，仅用于PDI_HAL_TEST
esc_et1200_regs_t escRegs[ESC_DEBUG_REGS_LENGTH];
#endif //#if HAL_ET1100
#endif//#ifdef PDI_HAL_TEST
/******************************SPI接口数据************************************/
#ifdef INTERFACE_SPI
//----------------------------指向SPI寄存器指针---------------------------------
volatile struct SPI_REGS *SpixRegs;
//----------------------------SPI数据接收缓冲区---------------------------------
volatile uint16_t   SPI_RxData[16];
#endif//#ifdef INTERFACE_SPI
/*****************************接口函数加载RAM**********************************/
#ifndef __cplusplus
#ifdef INTERFACE_SPI
#pragma CODE_SECTION(ESC_readSPI, ".TI.ramfunc");
#pragma CODE_SECTION(ESC_writeSPI, ".TI.ramfunc");
#endif
#pragma CODE_SECTION(ESC_timerIncPerMilliSec, ".TI.ramfunc");
#pragma CODE_SECTION(ESC_getTimer, ".TI.ramfunc");
#endif
/***************************************************************************
          函数名称: ESC_getTimer
          函数描述: 获取定时器时间
          输入参数:
              返回值: 当前CPU_TIMER0计数器值的取反值
***************************************************************************/
uint32_t ESC_getTimer(void)
{
    //定时器为减定时器，所有需返回定时器值的取反值
    return ~ ((uint32_t)(CpuTimer0Regs.TIM.all));
}
/***************************************************************************
          函数名称: ESC_clearTimer
          函数描述: 清除定时器时间(CPU_TIME0)
          输入参数:
              返回值:
***************************************************************************/
void ESC_clearTimer(void)
{
    /*寄存器版*/
    CpuTimer0Regs.TIM.all = 0;
    /*driverlib版*/

}
/***************************************************************************/

uint32_t ESC_timerIncPerMilliSec(void)
{
    return (uint32_t) 200000UL; //at 200MHz
}
/***************************************************************************/
#ifdef INTERFACE_SPI
/***************************************************************************
 *
 *  EtherCAT从控制器SPI硬件接口函数
 *
 * *************************************************************************/
/****************************************************************************
          函数名称: ESC_readSPI
          函数描述: 读取数据
          输入参数:
           offset_addr  数据读取的ESC地址
           numbytes     读取的字节数，限制为12个
           buffer       指向读取数据缓冲区的指针，存储为16位字的方式
              返回值:
****************************************************************************/
void ESC_readSPI(uint16_t offset_addr,uint16_t numbytes, uint16_t* buffer)
{
    uint16_t i,readval;
    uint16_t readphase[16];
//  Byte 0: A[12:5]                 //寄存器地址5到12位
//  Byte 1: A[4:0], CMD[2:0]        //寄存器地址0到4位+110b(三字节模式命令)
//  Byte 2: A[15:13], CMD[2:0], 00b //寄存器地址13到15位 +010b(读数据模式)
//  Byte 3: FFh                     //帧结束字节
    //装载第一个字节：地址5到12位
    readphase[0] =(offset_addr & 0x1FE0)<<3;
    //装载第二个字节：110B(三字节地址模式)+地址0到4位
    readphase[1] =(((offset_addr & 0x1F) << 3) | ESC_ETHERCAT_3BYTEADDR) << 8;
    //装载第三个字节：地址13到15位+010B(读数据模式)+00
    readphase[2] = (offset_addr & 0xE000) | (ESC_ETHERCAT_READ << 10);
    //装载空字节读取字节数据(装载数量由读取字节个数决定)
    for(i = 0; i < numbytes; i++)
    {
        readphase[i+3] = (uint16_t) ESC_ETHERCAT_CONTINUE << 8;
    }
    //装载帧结束字节0xFF
    readphase[numbytes+2] = (uint16_t)ESC_ETHERCAT_RDTERMINATE << 8;
    //使能SPI片选信号
    ESC_SPI_CS_0();
    //发送帧数据
    for(i = 0;i < numbytes + 3; i++)
    {
        SpixRegs->SPITXBUF = readphase[i];
    }
    //等待接收到读取数量的字节数据
    while (SpixRegs->SPIFFRX.bit.RXFFST < (numbytes + 3))
    {
        asm(" NOP");
        asm(" NOP");
        asm(" NOP");
    }
    //忽略非有效数据的字节
    while (SpixRegs->SPIFFRX.bit.RXFFST > numbytes)
    {
        readval = SpixRegs->SPIRXBUF;
    }
    //读取有效数据
    for (i = 0; (SpixRegs->SPIFFRX.bit.RXFFST > 0); i++)
    {
        //读取低字节
        readval = (SpixRegs->SPIRXBUF) & 0xFF;
        buffer[i] = (readval & 0xFF);
        //读取高字节
        readval = (SpixRegs->SPIRXBUF) & 0xFF;
        buffer[i] |= ((readval & 0xFF) << 8);
    }
    //SPI复位
    DELAY_US(5);
    SpixRegs->SPIFFTX.bit.TXFIFO=0;
    SpixRegs->SPIFFRX.bit.RXFIFORESET = 0;
    DELAY_US(2);
    SpixRegs->SPIFFTX.bit.TXFIFO=1;
    SpixRegs->SPIFFRX.bit.RXFIFORESET = 1;
    //失能SPI片选信号
    ESC_SPI_CS_1();
}
#define FIFO_LENGTH     12
/************************************************************************************
          函数名称: ESC_writeSPI
          函数描述: 写入数据
          输入参数:
           offset_addr  数据写入的ESC地址
           numbytes     写入的字节数，限制为12个
           wrdata       指向缓冲区的指针，存储为16位字的方式
              返回值:
*************************************************************************************/
void ESC_writeSPI(uint16_t offset_addr,uint16_t *wrdata, uint16_t numbytes)
{
    //16位字发送计数器
    uint16_t numwords = 0;
    //帧数据缓冲区
    uint16_t writebuffer[3];
    // Byte 0: A[12:5]
    // Byte 1: A[4:0], 110b             (110b is 3-byte cmd extension)
    // Byte 2: A[15:13], CMD[2:0], 00b  (110b is 3-byte cmd extension)
    //装载第一个字节:地址5到12位
    writebuffer[0] = (offset_addr & 0x1FE0) << 3;
    //装载第二个字节:110B(三字节地址模式)+地址0到4位
    writebuffer[1] = (((offset_addr & 0x1F) << 3) | ESC_ETHERCAT_3BYTEADDR) << 8;
    //装载第三个字节:地址13到15位+100B(写数据命令)+00B
    writebuffer[2] = (offset_addr & 0xE000) | (ESC_ETHERCAT_WRITE << 10);
    //使能SPI片选信号
    ESC_SPI_CS_0();
    //延时15ns
    asm(" NOP");
    asm(" NOP");
    asm(" NOP");
    asm(" NOP");
    asm(" NOP");
    //发送帧头
    SpixRegs->SPITXBUF = writebuffer[0];
    SpixRegs->SPITXBUF = writebuffer[1];
    SpixRegs->SPITXBUF = writebuffer[2];
    //发送数据
    for(numwords = 0; numwords < numbytes/2 ; numwords++)
    {
        //发送16位字的低字节
        SpixRegs->SPITXBUF= (((wrdata[numwords]) & 0x00FF) << 8);
        //发送16位字的高字节
        SpixRegs->SPITXBUF = ((wrdata[numwords]) & 0xFF00);
    }
    //处理数据单字节
    if(numbytes % 2 == 1)
    {
        SpixRegs->SPITXBUF= (((wrdata[numwords]) & 0x00FF) << 8);
    }
    //等待全部数据发送完成
    while(SpixRegs->SPIFFTX.bit.TXFFST != 0)
    {
        DELAY_US(2);
    }
    //复位SPI
    SpixRegs->SPIFFTX.bit.TXFIFO=0;
    SpixRegs->SPIFFRX.bit.RXFIFORESET = 0;
    DELAY_US(2);
    SpixRegs->SPIFFTX.bit.TXFIFO=1;
    SpixRegs->SPIFFRX.bit.RXFIFORESET = 1;
    //失能SPI片选信号
    ESC_SPI_CS_1();
}
/***********************************************************************************/
uint16_t ESC_readWordNonISR(uint16_t offset_addr)
{
    uint16_t data;
    DINT;
    ESC_readSPI(offset_addr, 2, &data);
    EINT;
    return  data;
}
/***********************************************************************************/
uint16_t ESC_readWordISR(uint16_t offset_addr)
{
    uint16_t data;
    DINT;
    ESC_readSPI(offset_addr, 2, &data);
    EINT;
    return  data;
}
/***********************************************************************************/

uint32_t ESC_readDWordNonISR(uint16_t offset_addr)
{
    uint32_t dword;
    DINT;
    ESC_readSPI(offset_addr, 4, (uint16_t *)&dword);
    EINT;
    return dword;
}
/***********************************************************************************/
uint32_t ESC_readDWordISR(uint16_t offset_addr)
{
    uint32_t dword;

    ESC_readSPI(offset_addr, 4, (uint16_t *)&dword);

    return dword;
}
/***********************************************************************************/
void ESC_readBlockISR(uint16_t* pData, uint16_t offset_addr,uint16_t numbytes)
{
    uint16_t i = 0, current_bytes = 0, last_byte = 0;
    if(numbytes & 0x1)
    {
        current_bytes = (numbytes - 0x1); // even align
    }
    else
    {
        current_bytes = numbytes;
    }
    while(current_bytes > 0) // input is actually in bytes
    {
        if( current_bytes >= FIFO_LENGTH)
        {
            ESC_readSPI(offset_addr, FIFO_LENGTH, (uint16_t *) &pData[i]);
            current_bytes -= FIFO_LENGTH;
            i+= FIFO_LENGTH/2; // data is in 16 bits
            offset_addr += FIFO_LENGTH;
        }
        else
        {
            ESC_readSPI(offset_addr, current_bytes, (uint16_t *) &pData[i]);
            offset_addr += current_bytes;
            i+= current_bytes/2;
            current_bytes = 0;
        }
    }

    if(numbytes & 0x1)
    {

        last_byte =  ESC_readWordISR(offset_addr);
        pData[i] = pData[i] & 0xFF00;
        pData[i] |= last_byte;

