isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
    }

}
/***********************************************************************************/
void ESC_readBlockNonISR(uint16_t* pData, uint16_t offset_addr,uint16_t numbytes)
{

    DINT;
    ESC_readBlockISR(pData, offset_addr,numbytes);
    EINT;

}

/***********************************************************************************/
void ESC_writeWordNonISR(uint16_t wrdata, uint16_t offset_addr)
{
    DINT;
    ESC_writeSPI(offset_addr, &wrdata, 0x02);
    EINT;
}
/***********************************************************************************/
void ESC_writeWordISR(uint16_t wrdata, uint16_t offset_addr)
{
    ESC_writeSPI(offset_addr, &wrdata, 0x02);
}
/***********************************************************************************/
void ESC_writeDWordNonISR(uint32_t wrdata, uint16_t offset_addr)
{
    DINT;
    ESC_writeSPI(offset_addr, (uint16_t *)&wrdata, 0x04);
    EINT;
}
/***********************************************************************************/
void ESC_writeDWordISR(uint32_t wrdata, uint16_t offset_addr)
{
    ESC_writeSPI(offset_addr, (uint16_t *)&wrdata, 0x04);
}
/***********************************************************************************/

void ESC_writeBlockISR(uint16_t* pData, uint16_t offset_addr,uint16_t numbytes)
{
    uint16_t i = 0, current_bytes = 0;

    if(numbytes & 0x1)
    {
        current_bytes = (numbytes - 0x1); // even align
    }
    else
    {
        current_bytes = (numbytes);
    }
    while(current_bytes > 0) // input is actually in bytes
    {
        if( current_bytes >= FIFO_LENGTH)
        {
            ESC_writeSPI(offset_addr, (uint16_t *) &pData[i], FIFO_LENGTH);
            current_bytes -= FIFO_LENGTH;
            i+= FIFO_LENGTH/2; // data is in 16 bits
            offset_addr += FIFO_LENGTH;
        }
        else
        {
            ESC_writeSPI(offset_addr, (uint16_t *) &pData[i], current_bytes);
            offset_addr += current_bytes;
            i+= current_bytes/2;
            current_bytes = 0;
        }
    }

    if(numbytes & 0x1)
    {
        //now send the last byte with extra alignment bytes
        // note that we read the adjacent byte and write it back
        ESC_readSPI(offset_addr, 2, &i);
        i &= 0xFF00;
        i |= (pData[((numbytes-1) >> 1)]) & 0xFF;   //pData is 16bit pointer
        ESC_writeSPI(offset_addr, &i, 2);
    }
}
/***********************************************************************************/
void ESC_writeBlockNonISR(uint16_t* pData, uint16_t offset_addr,uint16_t numbytes)
{

    DINT;
    ESC_writeBlockISR(pData, offset_addr,numbytes);
    EINT;
}


//-----------------------------------------------------------------------------------
// Function to initialize SPI port
//-----------------------------------------------------------------------------------
void ESC_initSPIFIFO(void)
{
    uint16_t m;
    EALLOW;

    // FIFO configuration
    SpixRegs->SPIFFCT.all=0x0;              // place SPI in reset
    for(m=0;m<3;m++);
    SpixRegs->SPIFFRX.all=0x2040;           // RX FIFO enabled, clear FIFO int
    SpixRegs->SPIFFRX.bit.RXFFIL = 16;      // Set RX FIFO level
    SpixRegs->SPIFFTX.all=0xE040;           // FIFOs enabled, TX FIFO released,

    // SPI configuration
    SpixRegs->SPIFFTX.bit.TXFFIL = 16;  // Set TX FIFO level
    SpixRegs->SPICCR.bit.SPICHAR = 0x7;//0xF; // Character Length  = 8
    SpixRegs->SPICCR.bit.CLKPOLARITY = 1; // Rising edge
    SpixRegs->SPICTL.bit.SPIINTENA = 1;     // Enabled
    SpixRegs->SPICTL.bit.TALK = 1;          //
    SpixRegs->SPICTL.bit.MASTER_SLAVE = 1;  // Master mode
    SpixRegs->SPICTL.bit.CLK_PHASE = 0;     // Add 1/2-cycle delay of Clk wrt SPISTEA
    SpixRegs->SPICTL.bit.OVERRUNINTENA = 1; // Overrun Interrupt enabled
    SpixRegs->SPISTS.all=0x0000;        // Clear Status bits (TxBufFull,INT, Overrun)

    // SpixRegs->SPIBRR.all = 0x63;            // LSPCLK/100
    ClkCfgRegs.LOSPCP.all = 0x2; // 0 = sysclk/1 = 200M; 1 = sysclk/2 = 100M   //ʱ��200M��4���50M
    SpixRegs->SPIBRR.all=0x004;     // Baud Rate = LSPCLK / (SPIBRR+1) [LSPCLK=SysClk/4 by default=50M]
    SpixRegs->SPIFFCT.all=0x00;                //50M��5����10M
    SpixRegs->SPIPRI.all=0x0020;            // Stop after transaction complete on EmuStop

    SpixRegs->SPIFFTX.bit.TXFFIENA = 0; // Disable TXFF INT
    SpixRegs->SPIFFRX.bit.RXFFIENA = 0; // disable RXFF INT


    SpixRegs->SPICCR.bit.SPISWRESET=1;  // Enable SPI

   EDIS;
}
/**********************************************************************************
       函数名称:ESC_initSPIAGpio(void)
       函数描述:初始化LaunchPad_F28379D评估板SPIA的GPIO引脚
                         使用LaunchPad_F28379D评估板,则SPIA对应引脚为:
          GPIO58 (SPISIMOA), GPIO59 (SPISOMIA), GPIO60 (SPICLKA), GPIO61 (SPISTEA)
       输入参数:
           返回值:
**********************************************************************************/
void ESC_initSPIAGpio(void)
{
    /*寄存器版初始代码*/
    //引脚上拉
    GpioCtrlRegs.GPBPUD.bit.GPIO58 = 0;//GPIO58 (SPISIMOA)
    GpioCtrlRegs.GPBPUD.bit.GPIO59 = 0;//GPIO59 (SPISOMIA)
    GpioCtrlRegs.GPBPUD.bit.GPIO60 = 0;//GPIO60 (SPICLKA)
    //设置复用功能
    GpioCtrlRegs.GPBMUX2.bit.GPIO58 = 3;//GPIO58 (SPISIMOA)
    GpioCtrlRegs.GPBGMUX2.bit.GPIO58 =3;
    GpioCtrlRegs.GPBMUX2.bit.GPIO59 = 3;//GPIO59 (SPISOMIA)
    GpioCtrlRegs.GPBGMUX2.bit.GPIO59 = 3;
    GpioCtrlRegs.GPBMUX2.bit.GPIO60 = 3;//GPIO60 (SPICLKA)
    GpioCtrlRegs.GPBGMUX2.bit.GPIO60 = 3;
    //CS片选信号设置为普通GPIO
    GpioCtrlRegs.GPBPUD.bit.GPIO61 = 0;
    GpioCtrlRegs.GPBDIR.bit.GPIO61 = 1;
    GpioCtrlRegs.GPBMUX2.bit.GPIO61 = 0;
    GpioCtrlRegs.GPBGMUX2.bit.GPIO61 = 0;
    /*C2000WARE版初始化代码*/
    GPIO_SetupPinOptions(58,GPIO_OUTPUT,GPIO_PULLUP);
    GPIO_SetupPinOptions(59,GPIO_INPUT,GPIO_PULLUP);
    GPIO_SetupPinOptions(60,GPIO_OUTPUT,GPIO_PULLUP);
    GPIO_SetupPinMux(58,GPIO_MUX_CPU1,15);
    GPIO_SetupPinMux(59,GPIO_MUX_CPU1,15);
    GPIO_SetupPinMux(60,GPIO_MUX_CPU1,15);
    GPIO_SetupPinOptions(61,GPIO_OUTPUT,GPIO_PULLUP);
    /*driverlib版初始化代码*/
    GPIO_setPadConfig(58,GPIO_PIN_TYPE_PULLUP);
    GPIO_setPadConfig(59,GPIO_PIN_TYPE_PULLUP);
    GPIO_setPadConfig(60,GPIO_PIN_TYPE_PULLUP);
    GPIO_setPinConfig(GPIO_58_SPISIMOA);
    GPIO_setPinConfig(GPIO_59_SPISOMIA);
    GPIO_setPinConfig(GPIO_60_SPICLKA);
    GPIO_setPadConfig(61,GPIO_PIN_TYPE_PULLUP);
    GPIO_setPinConfig(GPIO_61_GPIO61);
    GPIO_setDirectionMode(61, GPIO_DIR_MODE_OUT);
}
//-----------------------------------------------------------------------------------
// Function to initialize GPIOs for SPIB port
//   GPIO64, GPIO65, GPIO66, GPIO63 
//  Not used in TMDSECATCNCD379D kit
//-----------------------------------------------------------------------------------
void ESC_initSPIBGpio(void)
{
    EALLOW;
    // Enable pull-ups on SPISIMO/SPISOMI/SPICLK/SPISTE pins
    GpioCtrlRegs.GPCPUD.all &= 0xFFFFFFF8;
    GpioCtrlRegs.GPBPUD.all &= 0xFFFFFFFE;

