isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
    // Enable SPISIMO/SPISOMI/SPICLK pins
    GpioCtrlRegs.GPCGMUX1.bit.GPIO64 = 0x3;
    GpioCtrlRegs.GPCMUX1.bit.GPIO64 = 0x3;
    GpioCtrlRegs.GPCGMUX1.bit.GPIO65 = 0x3;
    GpioCtrlRegs.GPCMUX1.bit.GPIO65 = 0x3;
    GpioCtrlRegs.GPCGMUX1.bit.GPIO66 = 0x3;
    GpioCtrlRegs.GPCMUX1.bit.GPIO66 = 0x3;
    GpioCtrlRegs.GPBGMUX2.bit.GPIO63 = 0x3;
    GpioCtrlRegs.GPBMUX2.bit.GPIO63 = 0x3;

    // Enable SPISIMO/SPISOMI/SPICLK pins as async
    GpioCtrlRegs.GPCQSEL1.all |= 0xF;
    GpioCtrlRegs.GPBQSEL2.bit.GPIO63 = 0x3;

    EDIS;

}

//-----------------------------------------------------------------------------------
// Function to initialize GPIOs for SPIC port
//   GPIO122, GPIO123, GPIO124, GPIO125 
//   Function used in TMDSECATCNCD379D kit
//-----------------------------------------------------------------------------------
void ESC_initSPICGpio(void)
{
    EALLOW;
        // new control card with HD connector
        // Enable pull-ups on SPISIMO/SPISOMI/SPICLK/SPISTE pins
        //GPIO122,123,124,125
        GpioCtrlRegs.GPDPUD.all &= 0xC3FFFFFF;

        // Enable SPISIMO/SPISOMI/SPICLK pins
        GpioCtrlRegs.GPDGMUX2.bit.GPIO122 = 0x1;
        GpioCtrlRegs.GPDGMUX2.bit.GPIO123 = 0x1;
        GpioCtrlRegs.GPDGMUX2.bit.GPIO124 = 0x1;
        GpioCtrlRegs.GPDGMUX2.bit.GPIO125 = 0x1;

        GpioCtrlRegs.GPDMUX2.bit.GPIO122 = 0x2;
        GpioCtrlRegs.GPDMUX2.bit.GPIO123 = 0x2;
        GpioCtrlRegs.GPDMUX2.bit.GPIO124 = 0x2;
        GpioCtrlRegs.GPDMUX2.bit.GPIO125 = 0x2;

        // Enable SPISIMO/SPISOMI/SPICLK pins as async
        GpioCtrlRegs.GPDQSEL2.all |= 0x03F00000;
    EDIS;
}



#else //#ifdef INTERFACE_SPI

//-----------------------------------------------------------------------------------
// internal function called from the ESC_WriteBlock* APIs
//-----------------------------------------------------------------------------------
void ESC_writeBlockEMIF2(uint16_t* pData, uint16_t offset_addr,uint16_t numbytes)
{
    uint16_t i = 0;
    uint16_t numwords = 0;

    offset_addr = offset_addr >> 1;

    if(numbytes & 0x01) // ODD no. of bytes
    {
        numwords = (numbytes - 1) >> 1;
        while(numwords > 0)
        {
            ((volatile uint16_t *)pEsc)[offset_addr] = pData[i];
            offset_addr++;
            numwords--;
            i++;
        }
        //now the last byte
        //read last words
        i = ((volatile uint16_t *)pEsc)[offset_addr];
        i &= 0xFF00;
        //update the word with the byte that needs to be written
        i |= pData[((numbytes-1) >> 1)] & 0xFF;
        //write back the word with the updated byte
        ((volatile uint16_t *)pEsc)[offset_addr] = i;

    }
    else
    {
        numwords = (numbytes) >> 1;
        while(numwords > 0)
        {
            ((volatile uint16_t *)pEsc)[offset_addr] = pData[i];
            offset_addr++;
            numwords--;
            i++;
        }
    }
}
/***********************************************************************************/
uint16_t ESC_readWordNonISR(uint16_t offset)
{
    uint16_t value;
    DINT;
    value = ((((volatile uint16_t *)pEsc)[((offset)>>1)]));
    EINT;
    return value;
}
/***********************************************************************************/
uint16_t ESC_readWordISR(uint16_t offset)
{
    return ((((volatile uint16_t *)pEsc)[((offset)>>1)]));
}
/***********************************************************************************/
void ESC_readBlockNonISR(uint16_t *pData,uint16_t Address,uint16_t Len)
{
    DINT;
    memcpy((uint16_t *)(pData), &((uint16_t *) pEsc)[((Address) >> 1)], ((Len+1)>>1));
    EINT;
}
/***********************************************************************************/
void ESC_readBlockISR(uint16_t *pData,uint16_t Address,uint16_t Len)
{
    memcpy((uint16_t *)(pData), &((uint16_t *) pEsc)[((Address) >> 1)], ((Len+1)>>1));
}
/***********************************************************************************/
uint32_t ESC_readDWordNonISR(uint16_t Address)
{
    uint32_t value;
    DINT;
    value = (uint32_t)(((volatile uint32_t *)pEsc)[(Address>>2)]);
    EINT;
    return value;
}
/***********************************************************************************/
uint32_t ESC_readDWordISR(uint16_t Address)
{
    return (uint32_t)(((volatile uint32_t *)pEsc)[(Address>>2)]);
}
/***********************************************************************************/
void ESC_writeBlockNonISR(uint16_t *pData,uint16_t Address,uint16_t Len)
{
    DINT;
    ESC_writeBlockEMIF2(pData,Address,Len);
    EINT;
}
/***********************************************************************************/
void ESC_writeBlockISR(uint16_t *pData,uint16_t Address,uint16_t Len)
{
    ESC_writeBlockEMIF2(pData,Address,Len);
}
/***********************************************************************************/
void ESC_writeDWordNonISR(uint32_t DWordValue, uint16_t Address)
{
    DINT;
    ((((volatile uint32_t *)pEsc)[(Address>>2)]) = (DWordValue));
    EINT;
}
/***********************************************************************************/
void ESC_writeDWordISR(uint32_t DWordValue, uint16_t Address)
{
    ((((volatile uint32_t *)pEsc)[(Address>>2)]) = (DWordValue));
}
/***********************************************************************************/
void ESC_writeWordNonISR(uint16_t WordValue, uint16_t Address)
{
    DINT;
    ((((volatile uint16_t *)pEsc)[((Address)>>1)]) = (WordValue));
    EINT;
}
/***********************************************************************************/
void ESC_writeWordISR(uint16_t WordValue, uint16_t Address)
{
    ((((volatile uint16_t *)pEsc)[((Address)>>1)]) = (WordValue));
}
#endif  //#ifdefINTERFACE_SPI

/***********************************************************************************/
void ESC_releaseET1100Reset(void)
{
//      GPIO_SetupPinMux(ESC_RESET_ET1100_GPIO, GPIO_MUX_CPU1, 0);
 //     GPIO_WritePin(ESC_RESET_ET1100_GPIO, 1);  //release reset
}
/***********************************************************************************/
void ESC_holdET1100InReset(void)
{
 //     GPIO_SetupPinMux(ESC_RESET_ET1100_GPIO, GPIO_MUX_CPU1, 0);
 //     GPIO_WritePin(ESC_RESET_ET1100_GPIO, 0);  //hold in reset
}
/***********************************************************************************/
void ESC_configureLatch0GPIO(void)
{
    //This function configures SYNC0 GPIO as LATCH OUTPUT (Input to ESC)
    GPIO_SetupPinOptions(ESC_SYNC0_GPIO, GPIO_OUTPUT, GPIO_PULLUP);
    GPIO_SetupPinMux(ESC_SYNC0_GPIO, GPIO_MUX_CPU1, 0);
}
/***********************************************************************************/
void ESC_configureLatch1GPIO(void)
{
    //This function configures SYNC1 GPIO as LATCH OUTPUT
    GPIO_SetupPinOptions(ESC_SYNC1_GPIO, GPIO_OUTPUT, GPIO_PULLUP);
    GPIO_SetupPinMux(ESC_SYNC1_GPIO, GPIO_MUX_CPU1, 0);
}


//-----------------------------------------------------------------------------------
// ISR to handle PDI ISR
//-----------------------------------------------------------------------------------
interrupt void ESC_applicationLayerISR()
{
    //call the slave stack ISR routine
#if(ETHERCAT_STACK)
    PDI_Isr();
#endif
    PieCtrlRegs.PIEACK.all |= 0x01;     // Issue PIE ack
}

//-----------------------------------------------------------------------------------
// ISR to handle SYNC0 ISR
//-----------------------------------------------------------------------------------
interrupt void ESC_applicationSync0ISR()
{
#if(ETHERCAT_STACK)
    Sync0_Isr();
#endif
    //XINT5, PIE 12.INT3
    PieCtrlRegs.PIEACK.bit.ACK12 = 1;
}

//-----------------------------------------------------------------------------------
// ISR to handle SYNC1 ISR
//-----------------------------------------------------------------------------------
interrupt void ESC_applicationSync1ISR()
{
#if(ETHERCAT_STACK)
    Sync1_Isr();
#endif
    //XINT4, PIE 12.INT2
    PieCtrlRegs.PIEACK.bit.ACK12 = 1;
}

//-----------------------------------------------------------------------------------
// Function to enable debug of SYNC0 signal on ControlCard configurations
//-----------------------------------------------------------------------------------
void ESC_enableSync0DebugOnCCARD(void)
{
    //for debug of SYNC0 line.- the below code connects GPIO2 to the SYNC0
    //internally because on the HW board we cannot put a scope on SYNC0 on HighRose connector

    //Connect SYNC0 (GPIO86) is INPUT1 for
    EALLOW;
    InputXbarRegs.INPUT1SELECT = ESC_SYNC0_GPIO; //input1 is tied to GPIO113

    OutputXbarRegs.OUTPUT1MUX0TO15CFG.bit.MUX1 = 0x1; //INPUTXBAR1 to OUTPUTXBAR1
    OutputXbarRegs.OUTPUT1MUXENABLE.bit.MUX1 = 0x1;

    GpioCtrlRegs.GPAGMUX1.bit.GPIO2 = 0x01; //GPIO2 to OUTPUTXBAR1
    GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 0x01;
    EDIS;
}


//-----------------------------------------------------------------------------------
// Function to configure SYNC0 signal on ControlCard configurations
//-----------------------------------------------------------------------------------
void ESC_configureSync0GPIO(void)
{

