isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
         }
        ESC_writeDWordNonISR(0x00000000, test_address);
        dtest_data = ESC_readDWordNonISR(test_address);
        if(dtest_data != (uint32_t)0x00000000)
         {
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
            ESC_passFailSignalSetup();
            //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
            //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
            while(1)
            {
                //fail
                ESC_signalFail();
            }
         }

        ///////////////////////////////////////////////////
        //////READ WORD and WRITE WORD Non-ISR API Test
        ///////////////////////////////////////////////////
        dtest_data = ESC_readWordNonISR(test_address);
        ESC_writeWordNonISR(0xF00D, test_address);
        dtest_data = ESC_readWordNonISR(test_address);
        if((uint16_t)dtest_data != (uint16_t)0xF00D)
         {
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
            ESC_passFailSignalSetup();
            //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
            //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
            while(1)
            {
                //fail
                ESC_signalFail();
            }

         }
        ESC_writeWordNonISR(0x0000, test_address);
        dtest_data = ESC_readWordNonISR(test_address);
        if((uint16_t)dtest_data != (uint16_t)0x0000)
         {
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
            ESC_passFailSignalSetup();
            //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
            //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
            while(1)
            {
                //fail
                ESC_signalFail();
            }
         }

        ///////////////////////////////////////////////////
        //////READ WORD and WRITE WORD ISR API Test
        ///////////////////////////////////////////////////

        dtest_data = ESC_readWordISR(test_address+2);
        ESC_writeWordISR(0xBAAD, test_address+2);
        dtest_data = ESC_readWordISR(test_address+2);
        if((uint16_t)dtest_data != (uint16_t)0xBAAD)
         {
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
            ESC_passFailSignalSetup();
            //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
            //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
            while(1)
            {
                //fail
                ESC_signalFail();
            }

         }
        ESC_writeWordISR(0x0000, test_address+2);
        dtest_data = ESC_readWordISR(test_address+2);
        if((uint16_t)dtest_data != (uint16_t)0x0000)
         {
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
            ESC_passFailSignalSetup();
            //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
            //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
            while(1)
            {
                //fail
                ESC_signalFail();
            }
         }


        ///////////////////////////////////////////////////
        //////READ DWORD and WRITE DWORD ISR API Test
        ///////////////////////////////////////////////////
        dtest_data = ESC_readDWordISR(test_address);
        ESC_writeDWordISR(0xBAADF00D, test_address);
        dtest_data = ESC_readDWordISR(test_address);
        if(dtest_data != (uint32_t)0xBAADF00D)
         {
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
            ESC_passFailSignalSetup();
            //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
            //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
            while(1)
            {
                //fail
                ESC_signalFail();
            }

         }
        ESC_writeDWordNonISR(0x00000000, test_address);
        dtest_data = ESC_readDWordNonISR(test_address);
        if(dtest_data != (uint32_t)0x00000000)
         {
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
            ESC_passFailSignalSetup();
            //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
            //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
            while(1)
            {
                //fail
                ESC_signalFail();
            }
         }

    }

     ///////////////////////////////////////////////////
     //////READ BLOCK and WRITE BLOCK Non-ISR API Test
     ///////////////////////////////////////////////////

     ESC_writeBlockNonISR((uint16_t *)(&wr_test_data[0]),  ESC_PDI_RAM_START_ADDRESS_OFFSET, (TEST_DATA_LENGTH*4));//even
     ESC_readBlockNonISR((uint16_t *)(&rd_test_data[0]),  ESC_PDI_RAM_START_ADDRESS_OFFSET, (TEST_DATA_LENGTH*4));

     block_test_data(TEST_DATA_LENGTH*4);

     clear_test_data();

     ESC_writeBlockNonISR((uint16_t *)(&wr_test_data[0]),  ESC_PDI_RAM_START_ADDRESS_OFFSET, (TEST_DATA_LENGTH*4)-1);//odd
     ESC_readBlockNonISR((uint16_t *)(&rd_test_data[0]),  ESC_PDI_RAM_START_ADDRESS_OFFSET, (TEST_DATA_LENGTH*4)-1);

     block_test_data((TEST_DATA_LENGTH*4)-1);

     ///////////////////////////////////////////////////
     //////READ BLOCK and WRITE BLOCK ISR API Test
     ///////////////////////////////////////////////////

     init_wr_test_data();

     ESC_writeBlockISR((uint16_t *)(&wr_test_data[0]),  ESC_PDI_RAM_START_ADDRESS_OFFSET, (TEST_DATA_LENGTH*4));//odd
     ESC_readBlockISR((uint16_t *)(&rd_test_data[0]),  ESC_PDI_RAM_START_ADDRESS_OFFSET, (TEST_DATA_LENGTH*4));

     block_test_data(TEST_DATA_LENGTH*4);

     clear_test_data();

     ESC_writeBlockISR((uint16_t *)(&wr_test_data[0]),  ESC_PDI_RAM_START_ADDRESS_OFFSET, (TEST_DATA_LENGTH*4)-1);//odd
     ESC_readBlockISR((uint16_t *)(&rd_test_data[0]),  ESC_PDI_RAM_START_ADDRESS_OFFSET, (TEST_DATA_LENGTH*4)-1);

     block_test_data((TEST_DATA_LENGTH*4)-1);

}
#endif //PDI_HAL_TEST



